Revit 2026 API

# PanelTypeSetErase Method

---

Removes a specified panel type from the set.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Erase(
	PanelType item
)
```
```vb
Public Overridable Function Erase (
	item As PanelType
) As Integer
```
```cpp
public:
virtual int Erase(
	PanelType^ item
)
```
```fsharp
abstract Erase :
        item : PanelType -> int
override Erase :
        item : PanelType -> int
```

#### Parameters

item PanelType
    The panel type to be erased.

#### Return Value

Int32The number of panel types that were erased from the set.

#### Reference

PanelTypeSet Class

Autodesk.Revit.DB Namespace